Repository: siholsihol/BlazorTraining
Catalog: BlazorMenu/Resources/BlazorMenuResources.*.resx
Languages: id

# Auth_E002
source: Invalid refresh token.
id: Token refresh tidak valid.

# Auth_E003
source: Invalid user credentials.
id: Kredensial pengguna tidak valid.

# Auth_E004
source: Incorrect captcha.
id: Captcha salah.

# Auth_E005
source: Login failed.
id: Login gagal.

# ChangePassword_M001
source: Password changed successfully.
id: Password berhasil diubah.

# ChangePassword_P001
source: Old Password
id: Password Lama

# ChangePassword_P002
source: New Password
id: Password Baru

# ChangePassword_P003
source: Confirm Password
id: Password Password

# ChangePassword_V001
source: The Old Password field is required.
id: Kolom Password Lama wajib diisi.

# ChangePassword_V002
source: The New Password field is required.
id: Kolom Password Baru wajib diisi.

# ChangePassword_V003
source: The Confirmation Password field is required.
id: Kolom Konfirmasi Password wajib diisi.

# ChangePassword_V004
source: Passwords do not match.
id: Password tidak cocok.

# ChangePassword_V005
source: Password must be at least {0} characters long.
id: Password harus terdiri dari minimal {0} karakter.

# ChangePassword_V006
source: You can change your password only after {0} days from your last update.
id: Anda hanya dapat mengubah password setelah {0} hari sejak pembaruan terakhir.

# ChangePassword_V007
source: You cannot use your last {0} passwords.
id: Anda tidak dapat menggunakan {0} password terakhir Anda.

# ChangePassword_V008
source: Password must contain at least one letter.
id: Password harus mengandung setidaknya satu huruf.

# ChangePassword_V009
source: Password must contain at least one uppercase letter.
id: Password harus mengandung setidaknya satu huruf kapital.

# ChangePassword_V010
source: Password must contain at least one lowercase letter.
id: Password harus mengandung setidaknya satu huruf kecil.

# ChangePassword_V011
source: Password must contain at least one number.
id: Password harus mengandung setidaknya satu angka.

# ChangePassword_V012
source: Password must contain at least one special character.
id: Password harus mengandung setidaknya satu karakter khusus.

# ChangePassword_V013
source: Password cannot contain the user ID.
id: Password tidak boleh mengandung ID pengguna.

# Common_E001
source: Reference to {0} is null.
id: Referensi ke {0} tidak ditemukan.

# Common_E002
source: {0} is required.
id: {0} dibutuhkan.

# Common_E003
source: {0} is null.
id: {0} bernilai null.

# CONST_CopyrightYear
source: Copyright © 2025
id: Hak Cipta © 2025

# MenuTab_E001
source: {0} not found.
id: {0} tidak ditemukan.

# Page_E001
source: TargetPageType must inherit from R_Page.
id: TargetPageType harus mewarisi dari R_Page.

# Profile_M001
source: User info updated successfully.
id: Informasi pengguna berhasil diperbarui.

# Profile_V001
source: The Username field is required.
id: Kolom Nama Pengguna wajib diisi.

# Profile_V002
source: The Email Address field is required.
id: Kolom Alamat Email wajib diisi.

# Resource_E001
source: Error occurred for message ID {0} : {1}.
id: Terjadi kesalahan untuk ID pesan {0} : {1}.

# ValidationMessage_E001
source: EditContext is required but was not provided.
id: EditContext dibutuhkan tetapi tidak disediakan.

# _1d
source: 1 day
id: 1 hari

# _404Message
source: Make sure the address is correct and that the page hasn't moved.
id: Pastikan alamat sudah benar dan halaman tersebut tidak dipindahkan.

# _500Message
source: Try refreshing the page, or going back and attempting the action again.
id: Coba muat ulang halaman, atau kembali dan lakukan tindakan tersebut lagi.

source: All rights reserved.
id: Seluruh hak cipta dilindungi undang-undang.

source: Author
id: Pengirim

source: Cancel
id: Batal

source: Change Password
id: Ganti Password

source: Company ID
id: ID Perusahaan

source: Contact Us
id: Hubungi Kami

source: Database Server
id: Server Database

source: Earlier
id: Sebelumnya

source: Edit Photo
id: Edit Foto

source: FrontEnd Version
id: Versi FrontEnd

# _HoursAgo
source: {0} hours ago
id: {0} jam yang lalu

source: Just Now
id: Baru Saja

# _LastUpdatePassword
source: Last Password Update
id: Pembaruan Password Terakhir

source: Login
id: Masuk

source: Logout
id: Keluar

source: Mark all as read
id: Tandai semua sudah dibaca

source: Menu Version
id: Versi Menu

source: Message
id: Pesan

source: Message Date
id: Tanggal Pesan

# _MinutesAgo
source: {0} minutes ago
id: {0} menit yang lalu

source: More Information
id: Informasi Tambahan

# _NoNotification
source: No notifications found. You are up to date!
id: Tidak ada notifikasi. Anda sudah mendapatkan semua informasi terbaru!

source: Notifications
id: Notifikasi

# _PageNotFound
source: The page you're looking for is not found.
id: Halaman yang Anda cari tidak ditemukan.

source: Position
id: Jabatan

source: Profile
id: Profil

source: Profile & Account
id: Akun & Profil

source: Read
id: Sudah Dibaca

source: Search
id: Cari

source: Unread
id: Belum Dibaca

source: Update
id: Perbarui

source: User ID
id: ID Pengguna

source: Username
id: Nama Pengguna

source: View All
id: Lihat Semua

# _Whoops
source: Whoops, something went wrong!
id: Ups, terjadi kesalahan!
